{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "bidirectional_10_input"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_10", "trainable": true, "batch_input_shape": [null, 7, 1], "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 60, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_11", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_16", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 30, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_17", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 15, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "mean_squared_error", "metrics": [[{"class_name": "MeanSquaredError", "config": {"name": "mean_squared_error", "dtype": "float32"}}, {"class_name": "MeanAbsoluteError", "config": {"name": "mean_absolute_error", "dtype": "float32"}}, {"class_name": "MeanAbsolutePercentageError", "config": {"name": "mean_absolute_percentage_error", "dtype": "float32"}}, {"class_name": "RootMeanSquaredError", "config": {"name": "root_mean_squared_error", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0001250000059371814, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [120], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [120], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [60], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [60], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [60], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [60], "dtype": "float32"}, {"name": "bidirectional_10/forward_lstm_15/lstm_cell_22/kernel", "shape": [1, 240], "dtype": "float32"}, {"name": "bidirectional_10/forward_lstm_15/lstm_cell_22/recurrent_kernel", "shape": [60, 240], "dtype": "float32"}, {"name": "bidirectional_10/forward_lstm_15/lstm_cell_22/bias", "shape": [240], "dtype": "float32"}, {"name": "bidirectional_10/backward_lstm_15/lstm_cell_23/kernel", "shape": [1, 240], "dtype": "float32"}, {"name": "bidirectional_10/backward_lstm_15/lstm_cell_23/recurrent_kernel", "shape": [60, 240], "dtype": "float32"}, {"name": "bidirectional_10/backward_lstm_15/lstm_cell_23/bias", "shape": [240], "dtype": "float32"}, {"name": "bidirectional_11/forward_lstm_16/lstm_cell_25/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "bidirectional_11/forward_lstm_16/lstm_cell_25/recurrent_kernel", "shape": [30, 120], "dtype": "float32"}, {"name": "bidirectional_11/forward_lstm_16/lstm_cell_25/bias", "shape": [120], "dtype": "float32"}, {"name": "bidirectional_11/backward_lstm_16/lstm_cell_26/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "bidirectional_11/backward_lstm_16/lstm_cell_26/recurrent_kernel", "shape": [30, 120], "dtype": "float32"}, {"name": "bidirectional_11/backward_lstm_16/lstm_cell_26/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [15, 64], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_17/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "dense_17/bias", "shape": [1], "dtype": "float32"}, {"name": "lstm_17/lstm_cell_27/kernel", "shape": [60, 60], "dtype": "float32"}, {"name": "lstm_17/lstm_cell_27/recurrent_kernel", "shape": [15, 60], "dtype": "float32"}, {"name": "lstm_17/lstm_cell_27/bias", "shape": [60], "dtype": "float32"}]}]}